{
  "cookieConsent": {
    "message": "Diese App verwendet <strong>nur funktionale Cookies</strong>, um Ihre Einstellungen (Design, Einstellungen, Datumsauswahl) zu speichern. Wir <strong>sammeln keine personenbezogenen Daten über Cookies</strong>, verwenden keine Tracking-Cookies und senden keine Cookie-Daten an externe Server. Die gesamte Datenverarbeitung erfolgt lokal in Ihrem Browser.",
    "learnMore": "Mehr über Datenschutz erfahren",
    "gotIt": "Verstanden"
  },
  "loginDialog": {
    "title": "Bei Glooko anmelden",
    "description": "Melden Sie sich mit Ihrem persönlichen Microsoft-Konto an, um auf alle Funktionen zuzugreifen.",
    "signInButton": "Mit Microsoft anmelden",
    "signInWithGoogle": "Mit Google anmelden",
    "signingIn": "Anmeldung läuft...",
    "cancel": "Abbrechen",
    "errorMessage": "Anmeldung fehlgeschlagen. Bitte versuchen Sie es erneut.",
    "googleComingSoon": "Google-Anmeldung wird bald verfügbar sein! Diese Funktion befindet sich derzeit in der Entwicklung."
  },
  "logoutDialog": {
    "title": "Abmelden",
    "confirmMessage": "Möchten Sie sich wirklich abmelden?",
    "loggingOut": "Abmeldung läuft...",
    "cancel": "Abbrechen",
    "proUser": "Pro-Benutzer",
    "keyVaultSecret": "Key Vault Secret:",
    "loadingSecret": "Lade Secret...",
    "secretNotAvailable": "Nicht verfügbar"
  },
  "welcomeDialog": {
    "title": "Willkommen!",
    "greeting": "Willkommen, {{userName}}!",
    "greetingDefault": "Willkommen in unserer App!",
    "thankYou": "Vielen Dank, dass Sie sich uns angeschlossen haben! Wir freuen uns, Ihnen bei der Verwaltung und Analyse Ihrer Diabetes-Daten zu helfen.",
    "cloudSettingsSync": "Cloud-Einstellungssynchronisierung:",
    "cloudSettingsSyncDescription": "Ihre App-Einstellungen (Design, Glukose-Einheit, Schwellenwerte usw.) werden in der Cloud gespeichert, damit sie auf allen Ihren Geräten synchronisiert werden.",
    "privacyFirst": "Datenschutz an erster Stelle:",
    "privacyFirstDescription": "Wir speichern nur Ihre E-Mail-Adresse zur Kontoidentifikation und Ihre App-Einstellungen. Keine persönlichen Gesundheitsdaten, Glukosewerte oder medizinischen Informationen werden jemals in unserer Cloud gespeichert.",
    "privacyNote": "Wenn Sie Einstellungen nicht in der Cloud speichern möchten, klicken Sie auf \"Abbrechen\", um sich abzumelden. Sie können die App auch ohne Anmeldung nutzen.",
    "saveSettings": "Einstellungen speichern",
    "cancel": "Abbrechen"
  },
  "infrastructureErrorDialog": {
    "defaultTitle": "Etwas ist schiefgelaufen",
    "defaultDescription": "Bei der Verbindung zu unseren Diensten ist ein Fehler aufgetreten.",
    "serviceUnavailableTitle": "Dienst nicht verfügbar",
    "serviceUnavailableDescription": "Unsere Dienste sind derzeit nicht verfügbar. Dies könnte bedeuten, dass die Infrastruktur gerade eingerichtet wird oder dass es vorübergehende Zugriffsprobleme gibt.",
    "networkErrorTitle": "Netzwerkfehler",
    "networkErrorDescription": "Verbindung zu unseren Diensten nicht möglich. Bitte überprüfen Sie Ihre Internetverbindung und versuchen Sie es erneut.",
    "accessDeniedTitle": "Zugriff verweigert",
    "accessDeniedDescription": "Ihre Sitzung ist möglicherweise abgelaufen. Bitte versuchen Sie, sich erneut anzumelden.",
    "errorWithCode": "Fehler {{statusCode}}: {{message}}",
    "ok": "OK"
  }
}
